README.md
```mermaid
flowchart LR
    Internet([Internet]) --- Application[Web Application]
    subgraph Computer
        subgraph Browser[Web Browser]
            Application
        end
        agent[kel-agent]
        WSJTX[WSJT-X]
        rigctld[goHamlib]
        HRD[HRD]
        etc[...]
    end
    Application ---|websocket| agent
    agent ---|UDP| WSJTX
    agent ---|lib| rigctld
    agent -.->|UDP| HRD
    agent -.-> etc
```
