architecture.dot
digraph {
    Internet [ shape=septagon]
    subgraph clusterComputer{
        label="Computer";
        labeljust=l;
        style=rounded;
        fontsize=10;
        subgraph clusterBrowser {
            label="Web Browser                            ";
            labeljust=l;
            fontsize=10;
            color=lightgrey;
            Application [label="Web Application"; shape=box]
        };
        agent [label="kel-agent"; shape=box; style=filled; fillcolor=lightblue]
        WSJTX [label="WSJT-X"]
        rigctld [label="goHamlib"]
        HRD;
        etc [label="..."];
    }

    edge [style=bold; dir=none; fontsize=10;]

    Internet -> Application
    Application -> agent [label=" websocket"]
    agent -> WSJTX [label="UDP"]
    agent -> rigctld [label="lib"]
    agent -> HRD    [label="UDP"; style=dotted]
    agent -> etc   [style=dotted]
}
